Repository: pyconsk/2019.pycon.sk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sk

source: If you have created an interesting hardware project which uses Python and would like to share it to the world then bring it to PyCon SK 2019.
sk: Vytvorili ste zaujímavý hardvérový projekt, ktorý využíva Python, micro:bit alebo Raspberry Pi? Tak ho predveď na PyCone :-) Stačí ho prihlásiť ako príspevok a vo formulári vybrať možnosť Hardware Projects Showcase.

source: EduSummit workshops
sk: EduSummit workshopy

source: On saturday we will hold numerous educational workshops.
sk: Sobota bude patriť workshopom. Prihlasovanie workshopov ešte stále prebieha, avšak niekoľko ich už máme potvrdených:

source: Space invaders image
sk: Vesmírni votrelci

source: The Call for Proposals is still open, more info
sk: Staňte sa súčasťou programu!<br>Program konferencie ešte stále napĺňame kvalitným obsahom aj od Vás - účastníkov. Preto ak máte nádpad na zaujímavý prípevok, kliknite

source: We will update the workshop list after the Call for Proposals is closed.
sk: Po uzavretí prihlášok na prednášky a workshopov zverejníme zoznam všetkých workshopov.

source: More information about the schedule can be found
sk: Viac informácií o programe nájdete

source: Students from all 14 schools currently participating in Teaching with Hardware will join the SPy Cup contest, in which they create their own micro:bit project a create a step-by-step manual which the will publish under an open license on our website to inspire other teachers and students. The best projects will be awarded prizes and their authors will have a short presentation about their project at PyCon SK 2019.
sk: Študenti zo všetkých 14 škôl, ktoré sa v súčasnosti zúčastňujú projektu Výuka s hardvérom, sa zapoja do súťaže SPy Cup, v rámci ktorej vytvoria vlastný micro:bit projekt a vytvoria k nemu návod krok za krokom, ktorý uverejnia pod otvorenou licenciou na našich webových stránkach ako inšpiráciu pre ostatných učiteľov a študentov. Najlepším projektom budú udelené ceny a ich autori budú mať krátku prezentáciu o ich projekte na konferencii PyCon SK 2019.

source: More info can be found at <a href="https://www.ucimeshardverom.sk/sutaz">www.ucimeshardverom.sk/sutaz</a>
sk: Viac informácií nájdeš na <a href="https://www.ucimeshardverom.sk/sutaz">www.ucimeshardverom.sk/sutaz</a>

source: Teaching with Hardware
sk: Učíme s Hardvérom

source: The goal of the initiative <a href="%(url)s" target="_blank">Teaching with Hardware</a> is to introduce such activities into computing lessons at primary and secondary schools, which will familiarise students with interesting applications of programming and information technologies, thus motivating them in developing their digital literacy and algorithmic thinking. We do this by introducing physical computing with a small programmable device called BBC micro:bit, and by supporting teachers with methodical materials and teacher training. In october 2018 we started a PILOT project on 14 schools across Slovakia, and the results will be announced at PyCon SK 2019.
sk: Cieľom projektu <a href="%(url)s" target="_blank">Učíme s Hardvérom</a> je vniesť do výučby informatiky na základných a stredných školách praktické zadania, ktoré žiakom ukážu zaujímavé možnosti využitia informatiky a vďaka ktorým sa žiaci sami začnú zaujímať o rozvíjanie svojich informatických zručností a algoritmického myslenia. Robíme to pomocou fyzického programovania s malým programovateľným zariadením s názvom BBC micro:bit a podporou učiteľov metodickými materiálmi a ich školením. V októbri 2018 sme spustili projekt PILOT na 14 školách po celom Slovensku. Jeho výsledky budú predstavené na konferencii PyCon SK 2019.

source: Poster Session
sk: Posterová sekcia

source: We will host a poster session and we will be happy if you get involved.
sk: Budeme organizovať aj posterovú sekciu a budeme radi, ak sa zapojíš.

source: The <a href="%(url)s" target="_blank">winners of Python Cup</a> will be awarded at EduSummit.
sk: V sekcii EduSummit budú vyhlásení <a href="%(url)s" target="_blank">víťazi súťaže Python Cup</a>.

source: What kind of ticked should I buy?
sk: Aký druh lístka by som si mal/a kúpiť?

source: All available tickets apply for the whole PyCon SK conference, including the EduSummit section. All of the talks and workshops take place at the same venue and you can decide which talks and workshops you want to attend.
sk: Všetky druhy vstupeniek platia na celú konferenciu PyCon SK vrátane sekcie EduSummit. Všetky prednášky a workshopy sa konajú na tom istom mieste a môžeš sa rozhodnúť, ktoré prednášky a workshopy chceš navštíviť.

source: If you are a teacher or student you are eligible for a discount.
sk: Ak si učiteľ alebo študent, máš nárok na zľavu.

source: Sponsorship
sk: Sponzoruj

source: We need you — EduSummit seeks for sponsors and partners!
sk: Potrebujeme vás — EduSummit hľadá sponzorov a partnerov!

source: By supporting PyCon you also support numerous educational activities during the conference. If the conference is profitable we finance educational activities during the whole year.
sk: Sponzorovaním konferencie PyCon podporíte aj množstvo vzdelávacích aktivít počas konferencie. V prípade, že bude konferencia zisková, budeme zo zisku financovať vzdelávacie aktivity počas celého roka.

source: Get in touch with us or visit our <a href="%(url)s">sponsorship page</a> for more information.
sk: Neváhajte nás kontaktovať. Viac informácií o <a href="%(url)s">sponzoringu</a> nájdete na našej sponzorskej stránke.

source: Frequently Asked Questions
sk: Často kladené otázky

source: General Information
sk: Všeobecné informácie

source: Where will the conference happen?
sk: Kde sa uskutoční konferencia?

source: Slovak University of Technology in Bratislava
sk: Slovenská technická univerzita v Bratislave

source: Faculty of Informatics and Information Technologies
sk: Fakulta informatiky a informačných technológií

source: What languages are spoken?
sk: Akými jazykmi sa hovorí?

source: Talks will be mostly in English and Slovak language. Possibly we will have a few talks in Czech language. If you do not speak Slovak or Czech do not worry, we have two tracks so there will be always talk in English.
sk: Väčšina prednášok bude v anglickom a slovenskom jazyku. Je možné, že niekoľko prednášok môže byť aj v češtine.

source: Volunteers do speak English. In Slovakia there is mandatory second language in school so most of the attendees will speak English or other language (at least a little bit).
sk: Dobrovoľníci hovoria po anglicky. Na Slovensku je povinná výuka anglického jazyka, takže väčšina účastníkov by mala rozumieť aspoň trochu po anglicky.

source: What is the difference between self funded (individual rate) and full-price (corporate rate) ticket?
sk: Aký je rozdiel medzi cenou lístka pre jednotlivca a plnou cenou (korporátnou)?

source: Both tickets are valid for full three conference days. Including everything mentioned on tickets page. Difference is if you pay for the ticket yourself or your employer (company). For those who pay for them selves we are trying to be more inclusive so anybody can afford the ticket. This way we are able to support teachers and students for whom the price might be too high.
sk: Z hľadiska obsahu sú oba lístky rovnaké (vstupenka na 3 dni konferencie so všetkým). Rozdiel je v tom, či si lístok kupuje jednotlivec, alebo či lístok kupuje firma. Je to pre to, aby sme mohli poskytovať jednotlivcom, ktorí si vstupenku platia z vlastného vrecka, za prijateľnejšiu cenu, a taktiež vďaka tomu vieme podporovať učiteľov či študentov informatiky, pre ktorých by štandardná cena určená pre programátorov bola privysoká.

source: Companies can add the tickets to their costs.
sk: Firmy si taktiež sumu zaplatenú za vstupenku vedia zaradiť do nákladov.

source: I don't have PayPal account, is there any other way to buy a ticket?
sk: Nemám PayPal účet, je možné kúpiť vstupenku inak ako cez Tito?

source: Currently, it is not possible to pay via PayPal without a Paypal account.
sk: V súčasnosti nie je možné platiť cez Paypal bez registrácie.

source: Therefore we accept also a wire transfer. This method, however, requires manual processing, which may lead to little delay. Please send us a list of tickets you are interested in, we will send you variable symbol and after we receive the payment, we will issue and send the requested tickets to you by email.
sk: Z tohto dôvodu akceptujeme aj bankový prevod. Tento spôsob platby však vyžaduje manuálne spracovanie, preto môže dôjsť k malému zdržaniu. Napíšte nám, o aké lístky máte záujem, my vám zašleme variabilný symbol a po pripísaní sumy na náš účet vám vystavíme a pošleme emailom vstupenku.

source: We also accept Bitcoin, Litecoin and (possibly) other crypto currencies. Please send us a list of tickets you are interested in, and currency you want to use and we'll send you a wallet address and once the payment is confirmed, we will issue and send the requested tickets to you by email.
sk: Akceptujeme aj Bitcoin, Litecoin prípadne iné krypto meny. Napíšte nám, o aké lístky máte záujem a menu ktorou chcete platiť. Zašleme Vám adresu penaženky a po potvrdení sumy v nášej peňaženke Vám vystavíme a pošleme emailom vstupenku.

source: For transaction in Bitcoin use: <a href="https://tallyco.in/s/e51yzw/" target="_blank">https://tallyco.in/s/e51yzw</a>
sk: Pre transakcie v Bitcoine použite: <a href="https://tallyco.in/s/e51yzw/" target="_blank">https://tallyco.in/s/e51yzw</a>

source: What is included in the ticket?
sk: Čo je zahrnuté v cene lístku?

source: We made a list of things what you can expect at the conference on <a href="%(url)s">the tickets page</a>.
sk: Na <a href="%(url)s">stránke so vstupenkami</a> sme pripravili zoznam vecí, ktoré môžeš očakávať na konferencii.

source: Do you offer group discounts?
sk: Ponúkate množstevné zľavy?

source: If you would like to buy more than 15 tickets please contact us by email at info@pycon.sk.
sk: Ak máte záujem kúpiť viac ako 15 lístkov, kontaktujte nás emailom na info@pycon.sk.

source: Is there any another possibility to get to PyCon?
sk: Je aj iná možnosť, ako sa dostať na PyCon?

source: Yes <a href="%(url)s">submit a talk</a>, and if your talk is selected you will receive a speakers ticket for free.
sk: Áno, <a href="%(url)s">podaj si návrh na prednášku</a> a ak bude návrh prijatý, dostaneš rečnícky lístok zdarma.

source: If you are less than 15 years old and come accompanied by a parent, you can just purchase one ticket only for the parent, but you have to inform us in advance to issue an another ticket for the child.
sk: Ak máte menej ako 15 rokov a prídete v sprievode rodiča, stačí ak si lístok zakúpi iba rodič, no musíte sa nám ozvať aby sme vystavili vstupenku aj pre dieťa.

source: Will there be last moment tickets?
sk: Budete predávať aj lístky na poslednú chvíľu?

source: Last 50 tickets will be more expensive, so don't leave your ticket purchase to last moment!
sk: Posledných 50 lístkov bude mať vyššiu cenu, tak si nenechávajte kúpu lístku na poslednú chvíľu!

source: Do you have social event in the evening?
sk: Bude aj oficiálny večierok?

source: On Firday there will be an unofficial party. We will meet in a pub and have fun, no need for special ticket.
sk: V piatok bude neoficiálna party. Stretneme sa v pube a zabavíme sa. Nepotrebuješ žiaden lístok.

source: On Saturday we'll have an official conference dinner! There is a special ticket for this event.
sk: V sobotu budeme mať oficiálnu konferenčnú večeru! Na túto udalosť je potrebné kúpiť si samostatný lístok.

source: Is my conference ticket valid for the FRIDAY unofficial party?
sk: Platí môj konferenčný lístok na PIATKOVÚ neoficiálnu párty?

source: YES. You don't have to purchase a ticket for the FRIDAY unofficial party. In the pub everybody pays for themself.
sk: ÁNO. Na PIATKOVÚ neoficiálnu párty si nepotrebuješ kupovať lístok. V pube však každý platí za seba.

source: Is my conference ticket valid for the SATURDAY conference dinner (official social event)?
sk: Platí môj konferenčný lístok na SOBOTNÚ konferenčnú večeru (oficiálny spoločenský event)?

source: NO. You have to purchase a ticket for the SATURDAY conference dinner (official social event). Ticket to the dinner includes dinner in a form of a buffet and a welcome drink. You pay for all other drinks.
sk: NIE. NA SOBOTNÚ konferenčnú večeru (oficiálny spoločenský event) si musíš kúpiť lístok. Vstupenka na večeru zahŕňa večeru formou bufetu a welcome drink. Ďalšie drinky si platí každý sám.

source: <span>Be a part of </span>PyCon SK 2019
sk: <span>Buď súčasťou </span>PyConu SK 2019

source: 22-24 March
sk: 22.-24. marec

source: Days
sk: dní

source: Hours
sk: hodín

source: Minutes
sk: minút

source: Seconds
sk: sekúnd

source: <strong>Fourth year</strong> will happen <strong>22-24th March, 2019 in Bratislava</strong>.
sk: Hostiteľom <strong>štvrtého ročníka</strong> bude opäť <strong>Bratislava, 22.-24. Marec 2019</strong>.

source: The PyCon SK 2019 conference, which will take place in Bratislava, is the annual gathering for the community using and developing the open-source Python programming language. It is organized by the volunteers from the SPy o.z., civic association dedicated to advancing and promoting Python and other Open Source technologies and ideas. Through PyCon, the SPy o.z. advances its mission of growing the Slovak (and also international) community of Python programmers and Open Source supporters.
sk: Konferencia PyCon SK 2019, ktorá sa bude konať v Bratislave je každoročné stretnutie komunity využívajúcej a vyvíjajúcej otvorený programovací jazyk Python. Je organizovaná dobrovoľníkmi z občianskeho združenia SPy o.z., ktorého hlavným cieľom je šíriť povedomie o Pythone a ďalších otvorených technológiách. Prostredníctvom PyConu SPy, o.z. plní svoj cieľ - rozširovať slovenskú (a medzinárodnú) komunitu programátorov v Pythone a podporovateľov Open Source.

source: Because PyCon SK is backed by the non-profit SPy, we keep registration costs much lower than comparable technology conferences (or other conferences in neighbor countries) so that PyCon remains accessible to the widest group possible.
sk: Pretože PyCon SK je organizovaný neziskovou organizáciou SPy, naše registračné poplatky sú výrazne nižšie ako na porovnateľné technologické konferencie (alebo na konferencie v okolitých krajinách), vďaka čomu je PyCon dostupný širokej skupine ľudí.

source: PyCon SK is a diverse conference dedicated to providing an enjoyable experience to everyone. Help us do this by following our
sk: PyCon SK je pestrá konferencia zameraná na to, aby poskytla príjemný zážitok pre všetkých návštevníkov. Aby sme toto splnili, prosím dodržuj náš

source: code of conduct
sk: kódex správania

source: Great Speakers
sk: Vynikajúci rečníci

source: Have Fun
sk: Zábava

source: Respected industry leaders with future-tech talks.
sk: Rešpektované osobnosti hovoriace o technológiách budúcnosti

source: Apart from well recognized community members we also invite first time speakers to submit a talk.
sk: Okrem známych členov komunity radi privítame aj návrhy prednášok od spíkrov, ktorí budú vystupovať po prvýkrát.

source: If you've done something that you think other people might be interested in, or that you think they should know about, please do consider telling us about it.
sk: Ak si spravil/a niečo, čo by mohlo zaujímať aj iných, alebo si myslíš, že ostatní by o tom mali vedieť, príď nám o tom porozprávať.

source: Great opportunity to network
sk: Skvelá príležitosť na nové kontakty

source: PyCon is organized by the Python community and for the Python community. Joining the event makes you part of the community.
sk: PyCon je organizovaný Python komunitou pre Python komunitu. Zapojením sa do podujatia sa stávaš súčasťou komunity.

source: People at PyCon SK are very nice, so come and make new friends.
sk: Ľudia na Pycone sú veľmi milí, tak príď a spoznaj nových priateľov.

source: Besides great people you can meet interesting hi-tech companies to discuss job or business opportunities.
sk: Okrem skvelých ľudí tu môžeš stretnúť hi-tech spoločnosti a prediskutovať s nimi pracovné príležitosti aleboo biznis.

source: Buy ticket
sk: Kúp si lístok

source: Food and drinks are provided for all attendees.
sk: Strava a nápoje sú k dispozícii pre všetkých účastníkov.

source: On Friday we will have an unofficial party. We meet in a pub talk and have fun. Everybody at their own expense.
sk: V piatok budeme mať neoficiálnu párty. Stretneme sa v pube, pokecáme a zabavíme sa. Každý na vlastný účet.

source: On Saturday we will have an official dinner. We meet in a pub talk and have fun again :D Most of the volunteers and speakers join this party, but for this one you will need a separate ticket.
sk: V sobotu budeme mať oficiálnu večeru. Opäť sa stretnem v pube, pokecáme a zabavíme sa. Na túto udalosť však budeš potrebovať samostatný lístok.

source: Participants
sk: Účastníkov

source: Sessions
sk: Prednášok

source: Sponsors
sk: Sponzorov

source: News
sk: Novinky

source: PyCon SK 2019 speakers and website redesign.
sk: Spíkri na PyCon SK 2019 a redizajn webstránky

source: It is our privilege to announce first three speakers at PyCon SK 2019:
sk: Je nám cťou ohlásiť prvých troch spíkrov na PyCon SK 2019:

source: Helen Li from Google, prof. Juraj Hromkovič from ETH Zürich and Honza Král from Elastic.
sk: Helen Li z Google, prof. Juraj Hromkovič z ETH Zürich a Honza Král z Elasticu.

source: We have also launched new design of the conference website. How do you like it? Let us know on our social networks.
sk: Spustili sme nový dizajn konferenčnej web stránky. Ako sa ti páči? Daj nám vedieť na sociálnych sieťach.

source: PyCon SK 2019 Slack channel & Social media
sk: PyCon SK 2019 Slack kanál & sociálne médiá

source: Join us at our social media:
sk: Pridaj sa k nám na sociálnych sieťach:

source: Conference ticket sale is open.
sk: Predaj lístkov na konferenciu je otvorený.

source: Buy your ticket before they are gone... So far every PyCon SK has been sold out!
sk: Kúp si lístok skôr, ako sa vypredá... Zatiaľ sa vypredal každý PyCon SK!

source: Submit your talk proposal with short abstract and your bio. All selected speakers get a complimentary ticket to the conference.
sk: Pošli nám svoj návrh aj so stručným obsahom a životopisom. Všetci rečníci majú vstup na konferenciu zadarmo.

source: Awesome Speakers
sk: Úžasní rečníci

source: Listen, Learn, Get inspired.
sk: Počúvaj, uč sa a inšpiruj sa

source: senior software engineer with Google AI Genomics
sk: senior softvér vývojárka v Google AI Genomics

source: Python engineer at Elastic
sk: Python vývojár v Elastic

source: Back-end and infrastructure engineer at Crate.io, Django core contributor
sk: Technik backendu a infraštruktúry v Crate.io, Django core prispievateľ

source: Python engineer at Iceye
sk: Python vývojár v Iceye

source: Creator of Anvil
sk: Tvorca Anvilu

source: Python developer at Anvil
sk: Python vývojár v Anvile

source: Security Engineer
sk: Bezpečnostný inžinier

source: Tech Lead at Kiwi.com
sk: Vedúci technológií v kiwi.com

source: Cloud technology enthusiast
sk: Nadšenec cloudových technológií

source: Senior Software Architect
sk: Senior softvérový architekt

source: Software Engineer
sk: Softvérový inžinier

source: Python enthusiast and security evangelist
sk: Python nadšenec a bezpečnostný evanjelista

source: An opportunity for employers to look for candidates in tech conference packed with geeks and programmers in general and also for more or less experienced job seekers to meet with multiple tech companies in one place.
sk: Príležitosť pre zamestnávateľov hľadať pracovníkov priamo na konferencii plnej geekov a programátorov, ale aj pre viac či menej skúsených kandidátov, ktorí tu nájdu viaceré IT spoločnosti v rovnakom čase na jednom mieste.

source: Employers
sk: Zamestnávatelia

source: PyCon SK will be the capital of Python for three days, it will become a place with the highest density of Python programmers per square meter.
sk: PyCon SK bude hlavným mestom Pythonu, na tri dni sa stane miestom s najvyššou hustotou Pythonistov na štvorcový meter.

source: Besides Slovak professionals, there will be programmers from Hungary or Austria as there is no local PyCon, but also from Czechia, Poland, Germany etc.
sk: Okrem profesionálov zo Slovenska, sem príde aj mnoho programátorov z Maďarska či Rakúska, keďže tam nemajú lokálny PyCon, ale aj z Česka, Poľska, Nemecka a ďalších krajín.

source: You can seek for fresh graduates, but also for seasoned programmers who are looking for a change in their careers.
sk: Môžete tu hľadať čerstvých absolventov, ale aj skúsených programátorov, ktorí práve hľadajú nové výzvy vo svojej kariére.

source: Present your company and show what it is like to work with you.
sk: Predstavte svoju spoločnosť a ukážte, aké to je pracovať pre vás.

source: Students
sk: Študenti

source: Looking for your first real job as a programmer? PyCon SK is a great place with many companies eager to hire a Pythonista.
sk: Hľadáš si svoj prvý skutočný programátorský job? PyCon SK je na to ideálny - bude tu množstvo firiem, ktoré sa budú chcieť získať novú posilu do tímu Pythonistov.

source: Visit our Job fair or drop in the sponsors booths and talk with your potential future employer.
sk: Navštív náš Job fair, alebo sa zastav v sponzorských stánkoch a pokecaj so svojim možným budúcim zamestnávateľom.

source: Get an idea of how the interview with recruiter looks like.
sk: Zisti, ako to vyzerá na skutočnom pohovore.

source: Find the company that suits you and can use your skills best.
sk: Nájdi firmu, ktorá ti sedí a ktorá bude vedieť tvoje schopnosti využiť najlepšie.

source: Professionals
sk: Profesionáli

source: If you feel an urge to change your career after years of routine work, PyCon SK is the best place for you.
sk: Ak cítite potrebu zmeny po rokoch rutiny, PyCon SK je to najlepšie miesto pre vás.

source: Visit our job fair and talk with companies that will appreciate your experience.
sk: Navštívte náš Job fair a porozprávajte sa so spoločnosťami, ktoré ocenia vaše dlhoročné skúsenosti.

source: Even if you do not look for a new job, you might get an overview of what options you have.
sk: Dokonca aj keď práve nehľadáte nový job, nikdy nezaškodí mať prehľad o tom, aké možnosti máte k dispozícii.

source: Stay Updated
sk: Ostaň v kontakte

source: Subscribe to our newsletter
sk: Prihlás sa na odber newslettra

source: Your Email Here
sk: Napíš sem svoj email

source: email address for the newsletter
sk: emailová adresa pre odoberanie noviniek

source: Subscribe
sk: Prihlásiť sa

source: Which newsletters do you wish to subscribe to?
sk: Na ktorý newsletter sa chceš prihlásiť?

source: PyCon SK Newsletter (conference updates in EN lang.)
sk: PyCon SK Newsletter (info o konferncii, anglicky)

source: SPy o.z. Newsletter (monthly updates on Python meetups, PyCon SK and Učíme s Hardvérom - in SK lang.)
sk: SPy o.z. Newsletter (mesačný newsletter o Python meetupoch, PyCon SK a Učíme s Hardvérom, slovensky)

source: Email Marketing Permissions
sk: Povolenia pre emailový marketing

source: Please select all the ways you would like to hear from SPy o.z.:
sk: Prosím vyber si, akými spôsobmi chceš dostávať informácie od SPy o.z.:

source: Direct Mail
sk: Osobný email

source: You can unsubscribe at any time by clicking the link in the footer of our emails.
sk: Odhlásiť sa môžeš kedykoľvek kliknutím na link na konci našich emailov.

source: View previous campaigns.
sk: Zobraziť predchádzajúce kampane.

source: We use Mailchimp as our marketing platform.
sk: Ako našu marketingovú platformu používame Mailchimp.

source: Privacy Policy
sk: Ochrana súkromia

source: SPy o.z. Privacy and Security
sk: SPy o.z. Súkromie a bezpečnosť
