Repository: pyconsk/2019.pycon.sk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sk

source: SPy o.z. value and respect all individuals and organizations that utilize our services. We understand that you may be concerned about privacy issues that surround the use of the Internet.
sk: SPy o.z. si cení a rešpektuje všetky osoby a organizácie, ktoré využívajú naše služby. Rozumieme, že môžeš mať obavy o svoje súkromie v súvislosti s používaním Internetu.

source: We believe that you should have control over who receives your personal information, whether it concerns where you live, what your interests are, or how you choose to conduct transactions. We're focused on only one thing: manage Python community in Slovakia in a safe and secure environment.
sk: Sme presvedčení, že každý by mal mať kontrolu nad tým, kto dostáva jeho osobné informácie, či už o tom, kde žije, aké sú jeho záujmy, alebo ako vykonáva transakcie. Naším cieľom je len jediné: riadiť Python komunitu na Slovensku v bezpečnom prostredí.

source: Therefore, we do not disclose, share, sell, or trade information about your individual visits to *.pycon.sk or the information that you may give us such as your name, address, e-mail address or telephone number, to any outside companies. We will release personal information about you, if necessary, in order to comply with a valid legal process such as a search warrant or court order. If we receive such request we'll transparently create a transparency report.
sk: Preto neuvádzame, nezdieľame, nepredávame informácie o tvojich jednotlivých návštevách na *.pycon.sk alebo informácie, ktoré si nám mohol/mohla poskytnúť, ako napríklad meno, adresu, emailovú adresu alebo telefónne číslo, žiadnej spoločnosti alebo jednotlivcovi. Tvoje osobné údaje sprístupnime iba ak to bude potrebné v súvislosti s právnymi predpismi, napríklad v prípade hľadania osoby či v prípade súdneho procesu. V prípade, že dostaneme takúto požiadavku, transparentne vytvorím požadovaný report.

source: Other Web sites that you may link to from our site, including our partners' Web sites, have their own privacy policies. SPy o.z. is not responsible for the privacy practices of other Web sites. We encourage you to review the privacy policies of Web sites before providing them with any of your personal information.
sk: Iné web stránky, na ktoré môžu smerovať linky z našej web stránky, vrátane webstránok našich partnerov, majú svoje vlastné pravidlá na ochranu súkromia. SPy o.z. nie je zodpovedné za dodržovanie takýchto pravidiel na iných webstránkach. Odporúčame preštudovať si pravidlá ochrany súkromia webstránok predtým, ako im poskytneš akékoľvek osobné údaje.

source: At our events we respect peoples will not be photographed if they do not want to. Official photographers will ignore such people. We also ask our participants to do so as well.
sk: Na našich stretnutiach aj na konferencii rešpektujeme želanie ľudí nebyť fotografovaní, pokiaľ si to neželajú. Oficiálni fotografi budú takýchto ľudí ignorovať. Taktiež žiadame o to isté aj účastníkov našich akcií.

source: We respect the Code of Conduct, let us know if you feel we can improve our privacy and policy rules.
sk: Rešpektujeme Pravidlá správania sa, daj nám vedieť, ak sa ti zdá, že naše pravidlá, či už na ochranu súkromia alebo iné, môžeme zlepšiť.

source: How SPy o.z. Uses Information About You
sk: Ako Spy o.z. využíva informácie o tebe

source: When you register for an event, make donations or select a volunteer opportunity, we may specifically ask for information about you -- such as name, home or Internet address, and billing information -- in order to provide that service or information to you. This information will be used solely for the purposes of completing your registration, donation or locating the volunteer opportunity you are seeking.
sk: Ak sa zaregistruješ na naše podujatie, pošleš nám príspevok alebo sa prihlásiš ako dobrovoľník, môžeme od teba požadovať určité informácie, napríklad meno, domácu alebo internetovú adresa či fakturačné údaje, aby sme ti mohli poskytnúť požadovanú službu či informáciu. Takáto informácia bude použitá výlučne na účely dokončenia tvojej registrácie, príspevku alebo zadeleniu práce pre dobrovoľníka.

source: The information which SPy o.z. automatically gathers, such as the numbers and frequency of visitors to our site and its areas, is used only in the aggregate -- very much like television ratings that tell the networks how many people tuned in to a program. This collective data helps us determine how much our visitors use parts of the site so that we can improve our site to assure that it is as appealing as we can make it for as many of you as possible.
sk: Informácie, ktoré SPy o.z. automaticky zbiera, ako napríklad počet a frekvencia návštev webstránok, sa vyhodnocujú iba agregovane, ako napríklad hodnotenie televízií, ktoré hovorí, koľko ľudí sledovalo ich program. Tieto kolektívne údaje nám pomáhajú určiť, koľko našich návštevníkov používa webstránku a jej súčasti, vďaka čomu ju môžeme vylepšovať, aby bola príťažlivá a dostupná pre čo najväčšie množstvo ľudí.

source: SPy o.z. Security
sk: SPy o.z. bezpečnosť

source: SPy o.z. takes every precaution to protect our user's information. When users submit sensitive information via the Web site, your information is protected both online and offline.
sk: SPy o.z. robí všetky opatrenia pre ochranu užívateľských informácií. Keď užívateľ posiela citlivé informácie prostredníctvom webovej stránky, tieto informácie sú chránené online aj offline.

source: SPy o.z. uses Secure Sockets Layer (SSL) technology to keep your personal information as secure as possible. SPy o.z. helps to protect your information by working with partners that provide a secure and safe environment for credit card transactions.
sk: SPy o.z. robí všetky opatrenia na ochranu užívateľských informácií. Keď užívateľ poskytne citlivé údaje prostredníctvom web stránky, vaše informácie sú chránené online aj offline.

source: Third party services that may obtain some information about you:
sk: Služby tretích strán, ktoré môže získať časť informácií o tebe:

source: <strong>Tito</strong>: Event management website, we use for event ticket registration. Read their privacy and policy:
sk: <strong>Tito</strong>: webstránka na riadenie eventov, využívame ju na registráciu vstupeniek. Prečítaj si ich pravidlá ochrany súkromia:

source: <strong>PayPal</strong>: Payment provider, we use for event ticket payments. Read their privacy and policy:
sk: <strong>PayPal</strong>: Sprostredkovateľ platieb, využívame ho na platby za vstupenky na konferenciu. Prečítaj si ich pravidlá ochrany súkromia:

source: <strong>Google Analytics</strong>: Website performance analytics, we use to collect aggregated data about our website visitors. Read their privacy and policy:
sk: <strong>Google Analytics</strong>: Nástroj na analýzu výkonu webstránok, využívame ho na zber agregovaných dát o návštevníkoch našich webstránok. Prečítaj si ich pravidlá ochrany súkromia:

source: <strong>MailChimp</strong>: Newsletter and event update mass email provider, we use to send emails to multiple recipients. Read their privacy and policy:
sk: <strong>MailChimp</strong>: Nástroj na posielanie newslettrov a hromadných emailov, využívame ho na rozposielanie emailov viacerým prijímateľom. Prečítajte si ich pravidlá ochrany súkromia:

source: Third party service that could be avoided:
sk: Služby tretích strán, ktorým sa dá vyhnúť:

source: <strong>Tito</strong>: Join us on events that do not require tickets, such as monthly Python meetups. Unfortunately for PyCon SK conference ticket is required for everyone, however, you can use a pseudonym as we won't ask for your ID if you have a valid ticket (without any discount, for discounted tickets, student ID or similar might be required).
sk: <strong>Tito</strong>: Pridaj sa k nám na udalostiach, na ktoré nepotrebuješ vstupenky, napríklad pravidelné každomesačné stretnutia - meetupy. Bohužiaľ, na konferenciu PyCon SK je potrebná vstupenka pre každého, no môžeš použiť pseudonym, keďže nepožadujeme doklad totožnosti, ak máš platný lístok (bez zľavy, v prípade zľavnených lístkov môžeme požadovať študentský preukaz alebo podobný doklad).

source: <strong>PayPal</strong>: Request a payment via alternative methods: Bank transfer, cryptocurrencies, an extra fee for additional human work will apply.
sk: <strong>PayPal</strong>: Vyber si alternatívny spôsob platby: Bankovým prevodom, kryptomenami. V tomto prípade však bude účtovaný extra poplatok za ručné spracovanie transakcie.

source: <strong>Google Analytics</strong>: Use adblocker to block this service automatically for every site on the internet.
sk: <strong>Google Analytics</strong>: Používaj blokovanie trackerov na automatické blokovanie tejto služby na ktorejkoľvek stránke na Internete.

source: <strong>MailChimp</strong>: Do not subscribe to our newsletter, or request us not to include your email in mass emails when requesting an alternative payment method. If you are already subscribed, you can unsubscribe at any time, by clicking the link in the email footer.
sk: <strong>MailChimp</strong>: Neprihlás sa na odber newslettra, alebo nás požiadaj o vyňatie vášho emailu z hromadného emailingu. Ak už si prihlásený/á, môžeš sa odhlásiť kedykoľvek kliknutím na link na konci emailu.

source: PyCon SK Recording Release
sk: Súhlas so zverejnením nahrávok z PyConSK

source: See the <a href="http://pyvideo.org">http://pyvideo.org</a> for one such venue.
sk: Pozri si <a href="http://pyvideo.org">http://pyvideo.org</a> na podobnom mieste.

source: We might also perform interviews with poster presenters or attendees and require recording releases to publish them.
sk: Taktiež môžeme robiť rozhovory s autormi posterov alebo návštevníkmi a vyžiadať si povolenie na ich zverejnenie.

source: By default, the recording release checkbox is checked when submitting a proposal. If you wish to opt-out, uncheck the release checkbox, note that no recordings or live stream of your talk will be made. You cannot opt out of recording for lightning talks.
sk: Pri odosielaní návrhu je súhlas so zverejnením predvolene zapnutý. Ak si želáš nezverejňovať nahrávku, odznač checkbox. V takom prípade sa z tvojej prednášky nebude robiť záznam ani živé streamovanie. V prípade lightning talku nie je možné odmietnuť zverejnenie.

source: You agree to the following legalese, which certifies that you are the author of your presentation (or otherwise allowed to present it at PyCon), and which allows the SPy o.z. 1) to perform the necessary audio and video editing needed to prepare your presentation, and 2) to distribute the recordings to other people, including on YouTube, or video sites. Released under CC-BY license. It also allows other people to watch the recordings.
sk: Súhlasíš s nasledujúcou zmluvou, ktorá zabezpečuje, že si autorom svojej prezentácie (alebo oprávneným zverejniť ju na konferencii PyCon SK) a ktorá povoľuje SPy o.z. 1) vykonávať potrebné audio a video úpravy pri príprave vašej prezentácie a 2) distribuovať nahrávky ďalším ľuďom, vrátane YouTube, alebo iných video stránok. Zverejnené pod licenciou CC-BY. Taktiež umožňuje ostatným ľuďom sledovať tieto nahrávky.

source: Legalese
sk: Zmluva

source: I certify that I, the Submitter, am authorized to license this proposal and its associated presentation (the "User Submission") to the SPy o.z. for use in association with PyCon SK 2019.
sk: Potvrdzujem, že ja, Prispievateľ, som oprávnený poskytnúť licenciu na tento návrh na prednášku a príslušnú prezentáciu ("Príspevok") pre SPy o.z. na využitie v súvislosti s konferenciou PyCon SK 2019.

source: Specifically
sk: Konkrétne

source: I, the Submitter, certify that I am the creator (and own the copyright) of the User Submission.
sk: Ja, Navrhovateľ, potvrdzujem, že som autor (a vlastník copyrightu) Príspevku.

source: I, the Submitter, hereby grant the SPy o.z. to publish User Submission and its audio/video recordings under CC-BY license.
sk: Ja, Navrhovateľ, týmto povoľujem SPy o.z. zverejniť Príspevok a jeho audio/video nahrávky pod CC-BY licenciou.

source: I, the Submitter, specifically affirm the right to perform the User Submissions on the SPy o.z. web sites or on other web sites designated by the PSF (including, but not necessarily limited to YouTube).
sk: Ja, Navrhovateľ, potvrdzujem najmä súhlas so zverejnením Príspevku na webstránkach SPy o.z. alebo na ďalších web stránkach určených PSF (vrátane, ale nie nutne výlučne YouTube).

source: What's on when (more details to be confirmed)
sk: Predbežný program (viac detailov po potvrdení)

source: Friday
sk: Piatok

source: Saturday
sk: Sobota

source: Sunday
sk: Nedeľa

source: Talks [EN track]
sk: Prednášky [v EN]

source: Talks [both EN and SK]
sk: Prednášky [v EN aj SK]

source: Workshops [both EN and SK]
sk: Workshopy [v EN aj SK]

source: SPy Cup Presentations [SK]
sk: SPy Cup Prezentácie [SK]

source: Conference Game Finals [EN]
sk: Finále konferenčnej súťaže [EN]

source: Conference Contest
sk: Konferenčná súťaž

source: Sprints [both EN and SK]
sk: Šprinty [v EN aj SK]

source: EduSummit Talks [SK]
sk: EduSummit Prednášky [SK]

source: EduSummit Workshops [SK]
sk: EduSummit Workshopy [SK]

source: EduSummit Poster Session [both EN and SK]
sk: EduSummit Poster Session [v EN aj SK]

source: Main Poster session [both EN and SK]
sk: PyCon Poster Session [v EN aj SK]

source: Hardware Projects Showcase [both EN and SK]
sk: Hardware Projects Showcase [v EN aj SK]

source: Conference Party
sk: Konferenčná Párty

source: Social Event
sk: Spoločenská udalosť

source: Conference Dinner
sk: Konferenčná Večera

source: Speakers you can meet at PyCon SK 2019.
sk: Rečníci, ktorých môžete stretnúť na PyCone SK 2019

source: Honza is a Python engineer at Elastic, the company behind Elasticsearch and other open source products, where he maintains the python libraries. Before that he was part of Whiskey Media, using Django to build content website for large audiences. He always had large affinity of working with data and trying to help teams scale their code and data.
sk: Honza je Python inžinier v Elasticu, spoločnosti za Elasticsearchom a ďalšími open sourcovými produktami, kde spravuje pythonské knižnice. Predtým bol súčasťou Whiskey Media, používal Django na tvorbu web stránok pre väčšie publikum. Vždy ho priťahovala práca s dátami a snaha pomôcť tímom škálovať ich kód a dáta.

source: Helen Li is a senior software engineer with Google AI Genomics. She graduated from Massachusetts Institute of Technology with a bachelor's degree in computer science. Before working on Nucleus, she was an active contributor to the Chromium project, where she developed open-source libraries and tools for over four years.
sk: Helen Li je senior softvér inžinerka v Google AI Genomics. Promovala na Massachusetts Institute of Technology, pred prácou na Nucleuse, bola aktívnou prispievateľkou k projektu Chromium, kde viac ako štyri roky vyvíjala open sourcové knižnice a nástroje.

source: Markus Holtermann works as a back-end and infrastructure engineer at Crate.io. He has been a Django core contributor since early 2015. He is a member of the Django security team as well as an organizer and advisor for DjangoCon conferences. Markus has been a project lead at the German ubuntuusers.de community support platform where he discovered Python and Django in 2010.
sk: Markus Holtermann pracuje v Crate.io ako inžinier pre back-end a infraštruktúru. Bol Django core prispievateľom od začiatku roku 2015. Je členom Django bezpečnostného tímu a tiež organizátorom a poradcom pre konferencie DjangoCon. Markus viedol projekt ubuntuusers.de - nemeckej komunitnej platformy, kde v roku 2010 objavil Python a Django.

source: After several years of using Python in e-commerce, banking, and media sectors in the UK, Jakub currently leads a technical side of ground segment at Iceye, the Earth observation start up in Finland. They are building a large synthetic-aperture radar (SAR) satellite constellation and using Python extensively in various parts of the project. Iceye has recently successfully launched their second satellite ICEYE-X2 on board of SpaceX’s Falcon 9.
sk: Po niekoľkých rokoch používania Pythonu v e-commerce, bankách a médiách vo Veľkej Británii, Jakub momentálne vedie technickú časť pozemného segmentu v Iceye, fínskom startupe na sledovanie Zeme. Budujú veľký družicový SAR (synthetic-aperture radar) systém a Python využívajú vo veľkom v rôznych častiach projektu. Iceye nedávno úspešne vypustilo už druhú družicu ICEYE-X2 na palube rakety Falcon 9 spoločnosti SpaceX.

source: Meredydd has been programming since the halcyon days of QBasic and Delphi, when it was easy to get started building software. He created Anvil to bring those days back. Meredydd has worked in startups from telecomms to music, and has a PhD in the usability of programming from Cambridge.
sk: Meredydd programoval od starých dobrých čias QBasicu a Delphi, keď bolo ešte jednoduché začať tvoriť softvér. Vytvoril Anvil, aby sa tieto časy vrátili. Meredydd pracoval v startupoch od telkomu po hudbu a má PhD z Cambridge o využiteľnosti programovania.

source: Shaun started programming in earnest by simulating burning fusion plasmas in the worlds biggest laser system. He fell in love with Python as a data analysis tool, and has never looked back. Now he wants to turn everything into Python, which is why he works for Anvil.
sk: Shaun začal programovať simulovaním horiacej fúznej plazmy v najväčšom laserovom systéme na svete. Zahľadel sa do Pythonu ako nástroja na analýzu dát a odvtedy už nepozeral po žiadnom inom. Teraz chce všetko zmeniť na Python, preto pracuje v Anvile.

source: Security/DevOps Engineer
sk: Bezpečnostný a DevOps inžinier

source: Adam is currently working as Security Engineer and has already been SRE/System Engineer/DevOps Engineer for a long time. He is a UNIX Lover, devoted Python user and evangelist. Interested in operating systems, security, networking and almost anything interesting.
sk: Adam je momentálne bezpečnostný inžinier, ale ako SRE/bezpečnostný/DevOps inžinier pracuje už dlhý čas. Miluje UNIX, je oddaným používateľom a evanjelistom Pythonu. Zaujíma sa o operačné systémy, bezpečnosť, siete a vlastne čokoľvek zaujímavé.

source: Tech Lead at kiwi.com
sk: Vedúci technológií v kiwi.com

source: Dmitry is a Tech Lead at kiwi.com in Prague. Started with Python in 2010 as a hobby during the university, he switched to a fulltime developer job after the graduation. He loves writing tests and cares about code maintainability. His hobbies are open source and traveling.
sk: Dmitry je šéfom technológií v kiwi.com v Prahe. S Pythonom začal v 2010 ako hobby počas štúdia na univerzite, neskôr po skončení školy pokračoval ako fulltime developer. Miluje písanie testov a dbá na udržateľnosť kódu. Jeho hobby sú open source a cestovanie.

source: I’m passionate cloud technology enthusiast. For the first time I came across clouds at University when I was choosing my master’s thesis. My route began with open-source Openstack. After studies, I’ve started working at Davinci software as cloud specialist where I gained most of my knowledge about Amazon web services (AWS). For last four years my daily routine is architecture, implementation, maintenance, deployments, automation… of infrastructure and applications from development to production environments. I’m a collector of various AWS certifications and hobby Python developer. From time to time you can meet me at University of Zilina where I lecture about cloud technologies. You can also meet me at Conservatory of Zilina with the guitar in my hand.
sk: Som nadšencom cloudových technológií. S cloudom som sa prvýkrát stretol počas štúdií, keď som si vyberal tému diplomovej práce. Moja cesta začala s opensourcovým Openstackom. Po štúdiu som pracoval ako cloudový špecialista v Davinci software, kde som získal väčšinu svojich znalostí o Amazon web services (AWS). Posledné štyri roky je mojou dennou rutinou architektuúra, implementácia, údržba, nasadzovanie, automatizácia… infraštruktúry a aplikácií od vývojových až po produkčné prostredia. Zbieram rôzne AWS certifikáty a som hobby Pythonista. Z času na čas ma môžete stretnúť na Žilinskej univerzite, kde prednášam o cloudových technológiách. Stretnúť ma tiež môžete na žilinskom konzervatóriu s gitarou v ruke.

source: If you want to know more about possibilities of Amazon web services or just want to casually talk about cloud technology don’t hesitate to stop me anytime and ask.
sk: Ak chcete vedieť viac o možnostiach Amazon web services alebo sa chcete len porozprávať o cloudových technologiách, neváhajte ma kedykoľvek zastaviť a spýtať sa.

source: Born in Czechoslovakia, studied in France, living in Germany. Using Python to make the sun shine and the wind blow. Imports from pandas and asyncio, enjoys discovering the chaotic world of unicode and time zones.
sk: Narodený v Československu, študoval vo Francúzsku, žije v Nemecku. Python používa, aby svietilo slnko a fúkal vietor. Importuje z pandas a asyncio, rád objavuje chaotický svet unicodu a časových pásiem.

source: Software Engineer at Yelp
sk: Softvérový inžinier v Yelpe.

source: Currently software engineer at Yelp. Speaks at Python conferences and advocates about open source. Previously managed PyData Delhi conference series, and built a community of 5000+ people.
sk: Manoj pracuje aktuálne ako softvérový inžinier v Yelpe. Prednáša na Pythonských konferenciách a obhajuje otvorený softvér. V minulosti spoluorganizoval sériu konferencií PyData Delhi a vybudoval komunitu o veľkosti viac ako 5000 ľudí.

source: Joel Lord is passionate about web and technology in general. He likes to learn new things, but most of all he likes to share his discoveries. He does so by travelling to various conferences all around the globe. He graduated with a college degree in computer programming back in the last millennium. Apart for a little break to get his BSc in computational astrophysics, he has always been in the industry. As a technical evangelist with Auth0, he meets with developers to help them make the web a safer place. During his free time, he is usually found stargazing in a campsite somewhereor brewing a fresh batch of beer in his garage.
sk: Joel Lord je nadšený z webu a technológií všeobecne. Rád sa učí nové veci, ale najradšej zdieľa svoje objavy. To robí na rôznych konferenciách, kam cestuje po celej Zemi. Vyštudoval programovanie v minulom tisícročí. Okrem malej prestávky na diplom z astrofyziky vždy pracoval v tomto odvetví. Ako technický evanjelista pre Auth0 sa stretáva s vývojármi, ktorým pomáha urbiť web bezpečnejším. Vo voľnom čase zvyčajne hľadí na hviezdy niekde v alebo vo svojej garáži varí novú várku piva.

source: Sponsors &amp; Partners
sk: Sponzori a partneri

source: They helping us make this event possible.
sk: Pomáhajú nám zrealizovať toto podujatie

source: Gold Sponsors
sk: Zlatí sponzori
