Repository: pyconsk/2019.pycon.sk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sk

source: Or you can review the <a href="http://www.visitbratislava.com/" title="city pages for visitors" target="_blank" class="external">official city guide for visitors</a>, where you can also find other events that are happening in Bratislava.
sk: Prípadne si môžeš pozrieť <a href="http://www.visitbratislava.com/sk" title="stránky mesta pre návštevníkov" target="_blank" class="external">oficiálne stránky mesta, určené pre návštevníkov</a>, kde nájdete aj iné udalosti, ktoré sa práve odohrávajú v Bratislave.
