Repository: pyconsk/2019.pycon.sk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sk

source: The Kistler Group is a Swiss high-tech company and the global market leader in dynamic measurement technology. We develop and supply sensors, electronics and software backed up by a full range of services. In Bratislava we develop software for the next generation of IoT devices. With our software we help customer to manufacture higher quality products, to develop cleaner cars and to reduce congestions on the highways. Behind our success stand our passion for technology, our focus on innovation and a work environment that promotes teamwork. We develop vehicles that people can trust; we create measurement systems that save lives. Kistler helps to shape a better future.
sk: Kistler Group je švajčiarska high-tech spoločnosť a globálny líder v oblasti dynamických meraní. Vyvíjame a dodávame senzory, elektroniku a softvér spolu so širokou ponukou služieb. V Bratislave vyvíjame softvér pre ďalšiu generáciu IoT zariadení. S naším softvérom pomáhame našim zákazníkom vyrábať kvalitnejšie produkty, vyvíjať ekologickejšie autá a zmierňovať dopravné zápchy na cestách.Za naším úspechom je naša oddanosť technológiám, dôraz na inovácie a pracovné prostredie, ktoré podporujetímovú spoluprácu. Vyvíjame vozidlá, ktorým ľudia veria; vytvárame meracie systémy, ktoré zachraňujúživoty. Kistler pomáhať formovať lepšiu budúcnosť.

source: TITANS freelancers offers many attractive jobs and projects for IT freelancers. We cooperate with thousands of IT freelancers in Slovakia and abroad. We have signed partnership agreements with prestigious companies, institutions and recruitment agencies operating in Austria, Switzerland, Germany, Croatia, the Czech Republic and Slovakia, allowing us to offer IT freelancers attractive projects. See the list of jobs at www.titans.sk.
sk: TITANS freelancers ponúka mnoho zaujímavých pracovných ponúk a projektov pre IT freelancerov. Spolupracujeme s tisíckami IT freelancerov na Slovensku a v zahraničí. Podpísali sme partnerstvá s prestížnymi firmami, inštitúciami a agentúrami v Rakúsku, Švajčiarsku, Chorvátsku, Česku, a na Slovensku, čo nám umožňuje ponúkať IT freelancerom množstvo zaujímavých projektov. Pre ponuku jobov pozri www.titans.sk.

source: Red Hat is the worlds leading provider of open source software solutions, using a community-powered approach to reliable and high-performing cloud, Linux, middleware, storage, and virtualization technologies. As a connective hub in a global network of enterprises, partners, and open source communities, Red Hat helps create innovative technologies that liberate resources for growth and prepare customers for the future of IT.
sk: Red Hat je svetový líder vo vývoji slobodného a otvoreného softvéru, ktorý kladie dôraz komunitný prístup k spoľahlivému a výkonnému cloudu, Linuxu, middleware, storage a virtualizačným technológiám. V globálnej sieti firiem, partnerov a open-source komunít pomáha vytvárať inovatívne technológie, ktoré tvoria základy ďalšieho rasti a pripravuje svojich zákazníkov na budúcnosť IT.

source: Bronze Sponsors
sk: Bronzoví sponzori

source: Sticker Mule is the fastest and easiest way to buy custom printed products. Thousands of people trust us to make kick-ass stickers, labels, magnets, badges &amp; more. Order in seconds and get free online proofs, free shipping, and super fast turnaround!
sk: Sticker Mule je najrýchlejší a najjednoduchší spôsob ako nakúpiť ľubovoľné tlačové produkty. Tisícky ľudí nám už zverili výrobu nadupaných nálepiek, štítkov, magnetiek, odznakov... Objednajte si v priebehu niekoľkých sekúnd a získajte online záruku, dopravu zdarma super rýchle doručenie!

source: Media Partners
sk: Medálni partneri

source: Partners
sk: Partneri

source: Why become a sponsor?
sk: Prečo sa stať sponzorom?

source: We need you — PyCon SK 2019 in Bratislava seeks for sponsors and partners!
sk: Potrebujeme vás — PyCon SK 2019 v Bratislave hľadá sponzorov a partnerov!

source: PyCon is an annual gathering for the community using and developing the open-source Python programming language. The conference is completely organized by volunteers.
sk: PyCon je každoročné stretnutie komunity ľudí, ktorí používajú alebo vyvíjajú open source programovací jazyk Python. Konferencia je kompletne organizovaná dobrovoľníkmi.

source: The members of the Python community organize a PyCon conference in their home countries regularly, PyCon will happen in Slovakia for the fourth time.
sk: Členovia Python komunity organizujú PyCon konferencie vo svojich domovských krajinách pravidelne. PyCon bude na Slovensku už po štvrtý raz.

source: To ensure high-quality speakers and keep the tickets price available for everyone we need you, the sponsors, who allow the conference to take place.
sk: Aby sme mohli zabezpečiť kvalitných prednášajúcich a pritom udržať cenu vstupeniek dostupnú pre každého, potrebujeme vás, sponzorov, ktorí umožnia túto konferenciu uskutočniť.

source: Do not hesitate to contact us. We are flexible and willing to work with you to design a sponsorship package that is going to meet your business needs.
sk: Neváhajte nás kedykoľvek kontaktovať. Sme flexibilní a ochotní spolupracovať a navrhnúť s vami balíček sponzorstva, ktorý splní vaše obchodné potreby.

source: Recruitment
sk: Nábor

source: Are you looking for programmers? PyCon is the best place for meeting new talents. Many participants will be experienced developers looking for their next big career move.
sk: Hľadáte programátorov? PyCon je to najlepšie miesto pre stretnutie nových talentov. Mnohí účastníci budú skúsení vývojári, ktorí hľadajú svoj ďalší veľký kariérny krok.

source: Audience
sk: Publikum

source: Want to get your message across to the people, so they talk about you? PyCon is a great opportunity. People in the Python community like to discover and share new things.
sk: Chcete dostať svoje posolstvo medzi ľudí, aby sa o vás hovorilo? PyCon je na to skvelá príležitosť. Ľudia v Python komunite radi objavujú a zdieľajú nové veci.

source: Looking for new users for your product? Such people can be found at PyCon - they also will look for new products and ideas.
sk: Hľadáte nových používateľov pre váš produkt? Takých ľudí nájdete na PyCone - aj oni budú hľadať nové produkty a nápady.

source: Community
sk: Komunita

source: Looking for new contributors and partners for your open source project? PyCon is the place, where they also will look for you.
sk: Hľadáte nových prispievateľov a partnerov pre váš open source projekt? PyCon je miesto, kde aj oni budú hľadať vás.

source: Support
sk: Podpora

source: Are you using Python in your company? Support for community events is an excellent opportunity to contribute back.
sk: Používate vo vašej firme Python? Podpora komunitných udalostí je výborná príležitosť ako prispieť späť.

source: Thank you
sk: Ďakujeme

source: We'll get in touch as soon as possible.
sk: Ozveme sa čo najskôr

source: You can also buy tickets directly on the <a href="https://ti.to/pyconsk/2019" target="_blank">https://ti.to/pyconsk/2019</a> website in case the tito widget is not displayed correctly.
sk: Lístky si môžeš kúpiť aj priamo na webstránke <a href="https://ti.to/pyconsk/2019" target="_blank">https://ti.to/pyconsk/2019</a>, ak sa ti tito widget nezobrazuje správne.

source: What am I paying for?
sk: Za čo platím?

source: Speakers and Lecturers
sk: Rečníci a prednášajúci

source: Our speakers are the best. And they do it for free! However, we have to pay for their conference ticket and sometimes we cover the travel budget.
sk: Naši rečníci sú najlepší. A robia to zadarmo! Platíme im však ich vstupenky a niekdy im preplatíme cestovné náklady.

source: Expenses for flight tickets and hotel in Bratislava are a big part of our budget. We also do cover all the costs of recording and releasing the all of the talks.
sk: Výdavky za letenky a ubytovanie v bratislavských hoteloch tvoria veľkú časť nášho rozpočtu. Taktiež znášame všetky náklady súvisiace so záznamom a zverejnením všetkých príspevkov.

source: Community & Inclusion
sk: Komunita a inklúzia

source: PyCon is a special type of conference - it is organised by the community for the community
sk: PyCon je špeciálna konferencia - je organizovaná komunitou pre komunitu

source: By attending, you have a chance to meet like minded people and hear a lot of interesting stories. However, for those who can not afford to attend because of financial reasons we have opened a financial aid scheme and give free tickets.
sk: Ak sa zúčastníš konferencie, máš šancu stretnúť podobne naladených ľudí a vypočuť si množstvo zaujímavých príbehov. Pre tých, ktorí si z finančných dôvodov nemôžu dovoliť kúpiť lístok na konferenciu, sme pripravili program na podporu a máme pripravené určité množstvo lístkov zadarmo.

source: Conference T-shirt and other swag
sk: Tričko z konferencie a ďalšie drobnosti

source: What kind of conference would PyCon Slovakia be without a conference T-shirt?
sk: Čo by to bola za konferenciu bez konferenčného trička?

source: Each attendee receives one 100&#37; cotton T-shirt and other swag. Possibly a water bottle with our fancy PyCon Slovakia logo. We would love to hear your ideas...
sk: Každý účastník získa jedno 100&#37; bavlnené tričko a ďalšie veci. Možno to bude fľaša na vodu s naším super logom. Ale sme otvorení aj ďalším návrhom...

source: The conference takes place at the Faculty of Informatics and Information Technologies (Slovak University of Technology)
sk: Konferencia sa koná na Fakulte informatiky a informačných technológií (Slovenskej technickej univerzity)

source: Venue is in new building and have well equipped and pleasant auditoriums and lobbies. The first PyCon SK was one of the first conferences in this auditorium!
sk: Miesto konania je v novej budove, ktorá má príjemné a dobre vybavené prednáškové miestnosti a príslušné priestory. Prvý PyCon SK bol jednou z prvých konferencií v týchto priestoroch!

source: Refreshments
sk: Občerstvenie

source: Afraid of falling asleep during a talk? Don't worry, we have your back - All you can drink coffee, tea and water.
sk: Obávaš sa, že zaspíš počas prednášky? Už nemusíš, máme všetko - kávu, čaj či vodu.

source: We will have two proffesional baristas serving fresh coffee and tea all day long. Water fountains will be available on multiple spots in the lobby.
sk: Budeme mať dvoch profesionálnych baristov, ktorí vám počas celého dňa budú pripravovať čerstvú kávu alebo čaj. Zásobníky s vodou budú k dispozícii na viacerých miestach rovnomerne v celej lobby.

source: Lunch
sk: Obed

source: During all three days, a variety of warm food will be served for lunch
sk: Počas všetkých troch dní sa budú na obed servírovať rôzne teplé jedlá

source: Meat and vegetarian alternatives will be available.
sk: K dispozícii budú mäsité aj vegetariánske alternatívy

source: We also try to be as eco friendly as possible, and so we serve food on ceramic plates, eat with metal cutlery and drink water from reusable plastic bottles.
sk: Snažíme sa tiež byť čo možno najekologickejší, takže jedlo podávame na keramických tanieroch, jeme s kovovým príborom a pitnú vodu poskytujeme z recyklovateľných plastových fliaš.

source: Real Conference Ticket Price
sk: Skutočná cena vstupenky

source: The real price of one conference ticket would be much higher had it not been for our sponsors and partners, thanks to which we can afford to sell cheaper tickets.
sk: Skutočná cena vstupenky na konferenciu by bola oveľa vyššia, keby nás nepodporovali naši sponzori a partneri, vďaka ktorým môžeme lístky predávať oveľa lacnejšie.

source: Without sponsors and partners all tickets would cost over 90&euro; (including student and teacher tickets) and this price still does not include the enormous amount of volunteer work, which is done by the Python commnity before and during each PyCon.
sk: Bez sponzorov a partnerov by lístky stáli vyše 90&euro; (vrátane študentských a učiteľských lístkov) a táto cena stále nezahŕňa obrovské množstvo dobrovoľníckej práce, ktorú robí Python komunita pred a počas každého PyConu.

source: micro:bit Education Supporter Ticket
sk: Lístok podporovateľa vzdelávania s micro:bitom

source: <i>Teaching with Hardware</i> is a project of the Slovak Python User Group which strives to increase digital literacy and bring joy to computing classes on primary and secondary schools in Slovakia. We do this by using an educational physical computing board called ​ BBC micro:bit. The board can be programmed to interact with external devices, such as LED strips, buzzers, motion sensors, temperature sensors, and so on. By buying a <i>micro:bit Education Supporter Ticket</i> you provide one school in Slovakia with a kit of 20 micro:bits, LED strips, speakers, crocodile cables, robots, servo motors and so on.
sk: <i>Učíme s hardvérom</i> je projekt slovenských používateľov Pythonu (Slovak Python User Group), ktorý sa snaží zvyšovať digitálnu gramotnosť a priniesť zábavu na hodiny programovania na základné a stredná školy na Slovensku. Robíme to pomocou edukačného mikropočítača, ktorý sa volá BBC micro:bit. Mikropočítač je možné naprogramovať tak, aby interaqoval s externými zariadeniami, ako sú LED pásiky, bzučiaky, senzory pohybu či teploty a tak ďalej. Kúpou <i>lístku podporovateľa výuky s micro:bitom</i> vybavíte jednu školu na Slovensku s balíkom 20 micro:bitov, LED pásikov, reproduktorov, krokodíliek, robotov, servo motorov a ďalšieho vybavenia.

source: Within several weeks you will be informed which school received the kit and after several months we will inform you how successful were the students at creating their own hardware projects with the provided kits. More details about the project can be found in this <a href="%(pdf)s" target="_blank">PDF</a>. During PyCon SK 2019 there will be several presentations and workshops connected to the <i>Teaching with Hardware</i> project.
sk: V priebehu niekoľkých týždňov budete informovaný, ktorá škola obdržala tento výukový balík a o niekoľko mesiacov Vás budeme informovať ako úspešní boli študenti pri tvorbe vlastných harvérových projektov s poskytnutým vybavením. Podrobnosti o tomto projekte nájdete v tomto <a href="%(pdf)s" target="_blank">PDF</a>. Počas PyConu SK 2019 budú viaceré prezentácie a workshopy súvisiace s projektom <i>Učíme s hardvérom</i>.

source: How do you get to Slovak PyCon?
sk: Ako sa dostanete na slovenský PyCon?

source: Venue Address
sk: Adresa konferencie

source: Travelling to Bratislava
sk: Cestovanie do Bratislavy

source: Bratislava is one of the youngest capitals in Europe, and also one of the smallest. Despite this, it has a rich history of a free royal coronation town of Pressburg and multiple opportunities how to spend time there. Bratislava has unique location, it is the only capital int he world located on the border of three countries.Today, Bratislava is a major transport hub in Central Europe, and there are plenty possibilities of getting here.
sk: Bratislava patrí medzi najmladšie a tiež najmenšie hlavné mestá Európy. Napriek tomu má bohatú históriu slobodného kráľovského korunovačného mesta, kedy sa ešte nazývala Prešporok a mnoho možností, ako stráviť čas počas vašej návštevy mesta. Bratislava je unikátna svojou polohou, ako jediné hlavné mesto na svete sa nachádza na hranici troch štátov. Dnes je Bratislava významným dopravným uzlom v strednej Európe a možností, ako sa sem dostať, je neúrekom.

source: By air
sk: Letecky

source: If you are travelling to Bratislava, you can fly to the Bratislava airport (airport code: BTS) or the Vienna airport (airport code: VIE). Vienna airport has considerably better offer of flights.
sk: Ak cestuješ do Bratislavy, môžeš letieť na bratislavské letisko (kód letiska: BTS) alebo na letisko Viedeň (kód letiska: VIE). Viedenské letisko má v porovnaní s bratislavským podstatne väčší výber letov.

source: From Bratislava airport you can take taxi (use the phone, its cheaper), or take the bus #61 and then move to bus #39 at the Bajkalska station. Get off the bus at the station ZOO and simply follow the PyCon stickers up to the hill to university campus.
sk: Z bratislavského letiska môžeš ísť taxíkom (zavolaj si ho telefonicky, je to lacnejšie), prípadne môžeš ísť autobusom číslo 61 a na zástavke Bajkalská prestúp na autobus číslo 39. Linkou 39 sa odvezieš na zástavku ZOO, kde prichádzaš do cieľa. Ďalej už len nasleduj nálepky PyconSK smerom na kopec.

source: If you travel via Vienna airport, there are direct and cheap bus connections from early morning till midnight. One way ticket costs about 8 EUR and if you buy in advance, the ticket may be considerably cheaper. There are three airport shuttle buses between Vienna airport and Bratislava: SlovakLines (red buses), Blaguss (silver buses) and RegioJet (Yellow busses).
sk: Ak letíš do Viedne, medzi viedenským letiskom a Bratislavou premáva priame a cenovo dostupné autobusové spojenie každú hodinu od skorého rána až do neskorej noci - jednosmerná jazda stojí okolo 8 EUR, ak si zakúpiš lístok v predstihu môže byť výrazne lacnejší. Autobusovú prepravu prevádzkujú tri spoločnosti: SlovakLines (červené autobusy), Blaguss (strieborné autobusy), RegioJet (žlté autobusy). Týmito autobusmi sa dostaneš na hlavnú autobusovú stanicu Mlynské Nivy.

source: By car
sk: Autom

source: Arriving from Vienna, choose the direction Schwechat on A4 highway, then turn to highway A6 leading to Bratislava. After crossing the border you will soon enter Bratislava, then follow the direction Praha/Brno. Right after crossing the river of Danube leave the highway and follow the road along the highway. After several hundreds of meters you will get to the crossroad where you should turn left and cross the highway you have left a minute ago. After the bridge there is another crossroad where you turn right and immediately turn slightly left up the hill towards the university campus.
sk: Z Viedne smerom na letisko Schwechat po diaľnici A4, odboč na diaľnicu A6, ktorá vedie priamo do Bratislavy. Po príjazde do Bratislavy sleduj smer Praha/Brno a ihneď po prechode Dunaja zídite z diaľnice a pokračuj po ceste paralelnej s diaľnicou. Po niekoľko sto metroch prídete na nadjazd, kde odbočíte doľava, ponad diaľnicu smerom k výškovej budove Slovenskej televízie. Hneď za nadjazdom odboč doľava a následne doprava smerom do kopca k univerzitnému kampusu.

source: From Budapest, take the highway M1 heading to Gyor, follow this route until you see signs for highway M15 heading to Slovakia and Bratislava. After crossing the border follow the direction Praha or Brno according to instructions above.
sk: Z Budapešti po diaľnici M1 smerom na Gyor, neskôr odboč na cestu M15 smerom na Slovensko, do Bratislavy. Po prejazde hraníc pokračujte smerom na Brno podľa inštrukcií vyššie.

source: If you drive from Prague, take the highway D1 to Brno, once in Brno take the highway D2 heading to Slovakia and Bratislava. After arriving to Bratislava follow the highway and leave it at the exit Mlynska dolina after passing the tunnel. Be cautious, the exit is located right after the tunnel, so you should stay in right lane while in tunnel.
sk: Z Prahy po diaľnici D1 do Brna, tam odboč na D2, ktorá vedie až na Slovensko a pokračujte smerom do Bratislavy. Po príjazde do Bratislavy pokračuj po diaľnici a opusti ju na výjazde Mlynská dolina (smer Devín, Karlova Ves), ktorý sa nachádza za tunelom. Pozor, výjazd začína hneď za tunelom, preraď sa včas.

source: From eastern and southern Poland choose your way to Katowice. From there follow the road to Cadca, Slovakia. Follow the road all the way to Zilina, then switch to the highway D1 to Bratislava. After arriving to Bratislava, you should pass the river of Danube twice following the direction Praha/Brno, then leave the highway following the instructions above.
sk: Z Poľska si zvoľ najlepšiu cestu do Katowíc. Odtiaľ pokčuj po ceste smerom na Čadcu a potom po ceste prvej triedy až do Žiliny. Odtiaľ po diaľnici D1 až do Bratislavy. V Bratislave pokračuj po diaľnici smerom na Prahu/Brno podľa vyššie uvedených inštrukcií (mal/a by si dvakrát prekročiť Dunaj).

source: By bus
sk: Autobusom

source: All neighbouring capital cities Vienna, Prague, Budapest, Warsaw and Kiev have direct bus connections.
sk: Všetky okolité hlavné mestá - Viedeň, Praha, Budapešť, Varšava aj Kyjev - majú priame autobusové spojenie do Bratislavy.

source: Most of the buses will bring you to the main bus station - Mlynske Nivy. It is currently located in temporary location, so dont worry and keep calm if you arrive feeling like on construction site. Leave the area towards the blue oval building VUB (next to the building with BMW logo) where you find the station of city bus lines. We recommend you to take bus number 70 to the end station Most SNP (SNP bridge) and from there continue with line number 30 or 37 to the station ZOO.
sk: Autobusom sa dostaneš na hlavnú autobusovú stanicu - Mlynské Nivy. Momentálne sa kvôli výstavbe novej nachádza v dočasných priestoroch, preto sa nezľakni, keď vystúpiš z autobusu s pocitom, že si na stavenisku. Vyjdi z autobusovej stanice a zamier k modrej oválnej budove VUB (vedľa budovy s logom BMW), kde nájdeš zástavku mestskej hromadnej dopravy. Odporúčame ísť autobusom 70 na stanicu Most SNP a odtiaľ pokračovať autbousom 30 alebo 37 na zástavku ZOO.

source: By train
sk: Vlakom

source: All neighboring capital cities Vienna, Prague, Budapest, Warsaw and Kiev have direct train connections.
sk: Z hlavných miest všetkých susedných krajín, teda z Viedne, Prahy, Budapešti, Varšavy aj Kyjeva, sa priamo do Bratislavy možno dostať aj vlakom.

source: Once you arrive at the Bratislava train station (Bratislava hlavná stanica), leave the station through the main entrance. In front of the building, there are bus and tram stops. We recommend zou to take the bus number 32 to the station ZOO. If you plan to use city lines more often, we recommend you to check the website https://imhd.sk/ba/ for more information about the prices or the lines.
sk: Po príchode na hlavnú železničnú stanicu v Bratislave prejdi cez staničnú budovu k hlavnému vchodu. Pred stanicou sa nachádzajú zástavky mestskej dopravy. Odporúčame ísť autobusom číslo 32 a vystúpiť na stanici ZOO. Ak sa plánuješ pohybovať po meste metskou dopravou, odporúčame stránku https://imhd.sk/ba/ pre viac informácií o cenách cestovného či trasách liniek.

source: Accommodation
sk: Ubytovanie

source: There are plenty of opportunities for accommodation in Bratislava. From coach surfing, Airbnb to hostels and five star hotels. Even though it is not the main tourist season, we advise you to book your accommodations in advance.
sk: V Bratislave máš široké možnosti ubytovania: od coach surfingu cez Airbnb, hostely až po päťhviezdičkové hotely. Hoci sa konferencia koná mimo hlavnej turistickej sezóny, určite odporúčame zabezpečiť si ubytovanie v predstihu.

source: Guide
sk: Sprievodca

source: Bratislava offers much more than just PyCon. If you decide to stay in Bratislava a few days longer, have a look at <a href="http://mpba.sk/en" title="M_P_ BA: alternative Bratislava map" target="_blank" class="external">M_P_ BA</a> (alternative map of Bratislava) which lists popular attractions as well as unusual destinations within the city. Check out peoples' comments to find out about each location or event.
sk: V Bratislave sa popri konferencii môžete aj zabaviť a získať jedinečné zážitky. Ak sa rozhodnete ostať v Bratislave o niekoľko dní dlhšie, určite si pozri <a href="http://mpba.sk/sk" title="M_P_ BA: alternatívna mapa Bratislavy" target="_blank" class="external">M_P_ BA</a> (alternatívnu mapu Bratislavy), kde nájdeš prehľad obľúbených miest obyvateľov Bratislavy s ich autentickými odporúčaniami a subjektívnymi názormi.
