Repository: pyconsk/2019.pycon.sk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: sk

source: Official PyCon SK 2019 website
sk: Oficiálna stránka PyCon SK 2019

source: PyCon SK is a community-organized conference for the Python programming language, which will be held in Bratislava on March, 2019.
sk: PyCon SK je komunitou organizovaná konferencia pre programovací jazyk Python, ktorá sa bude konať v Bratislave v marci 2019.

source: Speakers
sk: Rečníci

source: Call for proposals
sk: Prihlás svoj príspevok

source: Schedule
sk: Program

source: Sponsoring
sk: Sponzoruj

source: About Us
sk: O nás

source: Venue
sk: Miesto konania

source: Code of Conduct
sk: Kódex správania

source: Call for volunteers
sk: Pridaj sa k nám

source: Tickets
sk: Vstupenky

source: General Queries
sk: Všeobecné otázky

source: Ticket Queries
sk: Otázky o vstupenkách

source: Event Organiser
sk: Organizátor podujatia

source: %(pycontm)s is a trademark for worldwide conference activities claimed by the %(psf)s.
sk: %(pycontm)s je ochranná známka %(psf)s pre celosvetové konferenčné aktivity.

source: PyCon SK is organized by volunteers from %(spy)s.
sk: PyCon SK je organizovaný dobrovoľníkmi z %(spy)s.

source: Our <a href="%(url)s">Privacy Policy</a>.
sk: Naše pravidlá pre <a href="%(url)s">Ochranu súkromia</a>

source: Found a bug? Missing some information? This is community managed website, contribute at our %(github)s.
sk: Našiel/našla si chybu? Chýba ti nejaká informácia? Toto je komunitou manažovaná webstránka, prispej na našom %(github)se.

source: Become a Sponsor
sk: Staň sa sponzorom

source: Submit your talk
sk: Prihlás svoju prednášku

source: Help out as a volunteer
sk: Pomôž ako dobrovoľník

source: Buy your ticket
sk: Kúp si lístok

source: Back to Top
sk: Návrat na vrch stránky

source: The Call For Proposals is open!
sk: Predkladanie návrhov prednášok a workshopov je otvorené!

source: Anyone can be part of the conference
sk: Aj Ty môžeš byť súčasťou konferencie

source: PyCon SK is organized by the Python community and for the Python community.
sk: PyCon SK organizuje Python komunita pre komunitu.

source: You're coming to the event, and that makes you part of the community. If you've done something that you think other people might be interested in, or that you think they should know about, please do consider telling us about it. We don't just want to hear from the experts or famous names - other perspectives are just as valuable, so don't let the idea that you're not expert or famous enough stop you. This is your invitation to submit a talk proposal if you haven't spoken at the conference before. First-time speakers talk proposals are preferred.
sk: Ak ideš na túto konferenciu, stávaš sa súčasťou komunity. Pokiaľ si spravil/a niečo, čo by mohlo zaujímať aj iných, alebo si myslíš, že ostatní by o tom mali vedieť, príď nám o tom porozprávať. Nechceme počúvať iba expertov a známe osobnosti - noví perspektívni rečníci sú tiež zaujímaví, preto sa, prosím, nenechaj odradiť pocitom, že nie si expert alebo známa osobnosť. Toto je naša pozvánka, aby si poslal/a návrh na prednášku, aj ak si ešte nikdy na konferencii neprednášal/a. Rečníci vystupujúci prvýkrát budú uprednostňovaní.

source: Don't hesitate
sk: Neváhaj

source: We are trying to finalize the conference program as soon as possible, the earlier you submit your proposal the higher chance of acceptance it has. The first deadline for submissions is 1st February 2019, when we will choose most of the talk and workshop slots of the conference. <b>The final deadline is 14th February 2019</b>, when we will choose the few remaining free slots.
sk: Pokúšame sa uzavrieť program konferencie ako skoro to len pôjde a čím skôr svoj príspevok prihlásiš tým väčšiu šancu má byť zaradený do programu. Prvý deadline na podávanie príspevkov je 1. februára 2019, kedy uzavrieme väčšinu programu. <b>Posledný deadline je 14. februára 2019</b>, kedy sa uzavrie zvyšná časť programu konferencie.

source: Still not sure about the details your proposal? No worries :-) <b>After submitting your proposal, you will receive a confirmation email with a link on which you can return to your proposal and make changes.</b>
sk: Ešte stále si nie si istý/á o konečnom popise pre Tvoj príspevok? Nemusíš sa báť :-) <b>Po vyplnení a odoslaní formulára obdržíš potvrdzovací mail, v ktorom bude odkaz na stránku, kde môžeš svoj príspevok kedykoľvek upraviť</b>.

source: Submit your proposal
sk: Odoslať návrh príspevku

source: Give us a tip
sk: Daj nám vedieť o zaujímavých rečníkoch

source: Do you know about a speaker that would be a good fit for our conference? <b>Let us know:</b>
sk: Poznáš niekoho, kto by mohol mať skvelý príspevok na PyCon a mali by sme ho/ju zavolať prednášať? <b>Daj nám vedieť:</b>

source: Guidelines for Proposal Submission
sk: Pokyny pre podávanie návrhov

source: There is no official restriction on the topic that you propose a talk session. Talks about Python or the Python community are most likely to line up with the interests of PyCon's audience, and a key consideration that the talk selection committee will be thinking about is your talk's ability to draw an audience. You may propose more than one, but the committee will ask you to choose only one talk if more than one of your proposals is accepted.
sk: Nie je žiadne oficiálne obmedzenie tém, ktoré môžete navrhnúť ako svoju prednášku. Prednášky o Pythone alebo komunite budú s vysokou pravdepodobnosťou zaujímavé pre publikum. Hlavným kritériom, ktoré bude komisia pri výbere prednášok zvažovať, je to, ako tvoja prednáška zaujme publikum. Je stanovený limit na jednu prednášku pre rečníka. Navrhnúť môžeš viac ako jednu, komisia ťa však vyzve, aby si vybral iba jednu prednášku (v prípade, že bude akceptovaných viac návrhov).

source: If you have any questions, please contact us via email: info@pycon.sk or join our Slack channel
sk: Ak máš otázky, kontaktuj nás emailom: info@pycon.sk alebo sa pridaj na náš Slack kanál.

source: All selected speakers get a complimentary ticket to the conference.
sk: Všetci rečníci majú vstup na konferenciu zadarmo.

source: Talks
sk: Prednášky

source: Most talks are 30 minutes long, but we do offer a limited number of 45-minute slots for important topics that promise to benefit from a more extensive treatment.
sk: Väčšina prednášok má vyhradenú dĺžku 30 minút, no ponúkame aj niekoľko 45 minútových vstupov pre významné témy, ktorým väčší rozsah umožní lepšie priblížiť danú tému publiku.

source: Workshops
sk: Workshopy

source: As with the talks, we are looking for tutorials that can grow this community at any level! We aim for tutorials that will advance Python, advance this community, and shape the future. As tutorials are longer than talks and are in an interactive classroom-like setting, they require much more preparation.
sk: Tak ako na prednášky, tešíme sa aj na tutoriály, ktoré budú vhodné pre komunitu na akejkoľvek úrovni! Prostredníctvom takýchto výukových programov sa snažíme zveľaďovať Python komunitu a formovať budúcnosť. Vzhľadom na to, že návody trvajú dlhšie a budú v menších miestnostiach, vyžadujú oveľa viac prípravy.

source: Are you involved in an interesting project, new service or application of technology? We would like to see your talk but if you - for any reason - prefer not to talk in large auditorium or you think your achievements are of limited interest and therefore not suitable for general audience why not present what you are doing in PyCon SK Poster Session?
sk: Pracuješ na zaujímavom projekte, novej službe či technologickej aplikácii? Radi by sme videli tvoju prednášku, ale ak z nejakého dôvodu nechceš prednášať vo veľkom auditóriu alebo si myslíš, že tvoja téma zaujme iba obmedzený počeť ľudí a nie je vhodná pre všeobecné publikum, príď nám ukázať, čo robíš, na PyCon SK Poster Session.

source: Recording release
sk: Súhlas so zverejnením nahrávok

source: Part of the motivation for PyCon SK is to help with Python education and advocacy in Slovakia and around the world. Accordingly, we intend to record all PyCon SK presentations and live stream and release the recordings on the web.
sk: Jednou z motivácií pre organizovanie PyConu je pomôcť so šírením vyučovania programovania v Pythone a jeho podporou na Slovensku i v zahraničí. Aj preto plánujeme nahrávať všetky prezentácie z konferencie a naživo streamovať a následne všetky zverejniť na web.

source: By submitting your talk or workshop proposal, or by signing up to give a lightning talk, you agree to give permission to the SPy o.z. to record, edit, and release audio and/or video of your presentation.
sk: Odoslaním návrhu na prednášku alebo workshop, alebo zapísaním sa na Lightning Talk dávaš súhlas SPy o.z. na nahrávanie, úpravu a zverejnenie audio a/alebo video záznamu z tvojej prezentácie.

source: Full recording release statement
sk: Plné znenie súhlasu s nahrávaním

source: About speaker
sk: O rečníkovi

source: Your name
sk: Vaše meno

source: Your name will be displayed on our website if your talk is accepted.
sk: Tvoje meno bude zobrazené na našom webe, ak bude prednáška akceptovaná.

source: If two or more people will be presenting, please separate the names with commas.
sk: V prípade, že príspevok bude prezentovať viacero ľudí, oddeľte mená prezentujúcich čiarkami.

source: Biography
sk: Životopis

source: Your biography will be displayed on our website if your talk is accepted.
sk: Tvoj životopis bude zobrazený na našom webe, ak bude prednáška akceptovaná.

source: If two or more people will be presenting, please separate the bios with a blank line.
sk: V prípade, že príspevok bude prezentovať viacero ľudí, oddeľte životopisy prázdnym riadkom.

source: Profile picture
sk: Profilová fotka

source: Please provide us with URL where we can download your profile picture that will be published on our website if your talk is accepted.
sk: Uveď, prosím, URL, odkiaľ si môžeme stiahnuť tvoju profilovú fotku, ktorá bude zverejnená na našom webe, ak bude prednáška akceptovaná.

source: Phone
sk: Telefón

source: Your phone will not be published! It is just for organizers to get in touch with you in case we need to discuss something with you or in case of emergency during the conference.
sk: Tvoj telefón nebude zverejnený! Je pre organizátorov, aby sa s tebou vedeli v prípade potreby spojiť pred alebo počas konferencie.

source: About talk
sk: O prednáške

source: Title
sk: Názov

source: Name of your talk/workshop as it will be displayed on our website if your talk is accepted.
sk: Názov tvojej prednášky/workshopu, ktorý bude zobrazený na našom webe, ak bude prednáška akceptovaná.

source: Abstract
sk: Obsah

source: Abstract of your talk will be published on our website if your talk is accepted.
sk: Abstrakt tvojej prednášky bude zverejnený na našom webe, ak bude prednáška akceptovaná.

source: Type
sk: Typ

source: What kind of performance you will do?
sk: Aký typ prezentácie plánuješ robiť?

source: Talk
sk: Prednáška

source: Language
sk: Jazyk

source: In which language your performance will be?
sk: V akom jazyku bude tvoja prezentácia?

source: English
sk: Anglický

source: Slovak
sk: Slovenský

source: Czech
sk: Český

source: Time Slot
sk: Časový blok

source: 30 minutes (talks)
sk: 30 minút (prednáška)

source: 45 minutes (talks/workshops)
sk: 45 minút (prednáška/workshop)

source: 60 minutes (workshops/Hardware Projects Showcase)
sk: 60 minút (prednáška/Hardware Projects Showcase)

source: 90 minutes (workshops)
sk: 90 minút (workshop)

source: 120 minutes (workshops)
sk: 120 minút (workshop)

source: 3 hours (workshops)
sk: 3 hodiny (workshop)

source: 4 hours (workshops)
sk: 4 hodiny (workshop)

source: Travel funding
sk: Cestovné náklady

source: Do you need travel funding?
sk: Potrebuješ príspevok na cestovanie?

source: Please bear in mind that we are community conference with limited budget and we might not be able to fund you.
sk: Maj prosím na pamäti, že sme komunitná konferencia s obmedzeným rozpočtom a je možné, že nebudeme môcť preplatiť tvoje náklady.

source: Yes
sk: Áno

source: No
sk: Nie

source: What city you will travel from?
sk: Z ktorého mesta budeš cestovať?

source: Please provide us with this city only if you need travel funding so we can calculate ticket price.
sk: Prosím zadaj, z ktorého mesta budeš cestovať, ak potrebuješ preplatiť cestovné náklady, aby sme mohli vypočítať cenu lístka.

source: Do you need accomodation?
sk: Potrebuješ ubytovanie?

source: Please provide us with this answer only if you need travel funding so we can calculate ticket price.
sk: Prosím odpovedz na túo otázku iba v prípade, že potrebuješ preplatiť cestovné náklady, aby sme mohli vypočítať cenu lístka.

source: Submit
sk: Odoslať

source: Alternatively
sk: Prípadne

source: directly in Google forms.
sk: priamo v Google formulároch.

source: We need you to help organize PyCon SK 2019!
sk: Potrebujeme ťa, aby si pomohol s organizáciou PyCon SK 2019!

source: All of our staff members are volunteers. We are looking for new members to join the team of organizers.
sk: Všetci členovia nášho tímu sú doborvoľníci. Do tímu organizátorov hľadáme nových členov.

source: This is great opportunity to meet people, make new friends and get the opportunity to learn new things.
sk: Je to skvelá príležitosť stretnúť ľudí, nájsť nových priateľov a aj sa naučiť nové veci.

source: As a volunteer you get a free ticket to the conference as a thank you for making the change in our society.
sk: Ako dobrovoľník dostaneš voľný lístok na konferenciu ako poďakovanie za to, že pomáhaš zlepšovať nasšu spoločnosť.

source: If you spend more than 40 hours during the year as a volunteer you can give 3%% to any registered non-profit in your tax return.
sk: Ak v priebehu roka odpracuješ viac ako 40 hodín ako dobrovoľník, môžeš darovať až 3%% zo svojich daní ktorejkoľvek zaregistrovanej neziskovke.

source: Your phone
sk: Tvoj mobil

source: Something about you
sk: Niečo o tebe

source: We would like to know you, write something about yourself and also why you would like to help out...
sk: Radi by sme vedeli niečo o tebe, ale aj prečo nám chceš pomôcť...

source: What is your time estimate you can spend as volunteer?
sk: Napíš časový odhad koľko by si sa mohol(a) venovať dobrovoľníctvu pre SPy o.z.?

source: We need just rought estimate, for example: our daily, two hours a week...
sk: Stačí orientačna informácia, napr. hodina denne, dve hodiny týždenne...

source: What would you like to do?
sk: Je niečo konkrétne čo by si rad(a) robil(a)?

source: Let us know what you are experienced in? If you have a vision and no experience, that is alright, write down what you would like to do and surely we'll find a tasks to realize the vision.
sk: Ak je niečo, v čom máš skúsenosti, o ktoré sa chceš s nami podeliť, napíš nám, čo to je. Ak máš predstavu, čo chceš robiť a nemáš žiadne skúsenosti, nevadí, podeľ sa s nami o svoje predstavy a určite nájdeme úlohy, v ktorých sa môžeš realizovať...

source: Where did you find out about SPy o.z.?
sk: Odkiaľ si sa dozvedel(a) o SPy o.z.?

source: The Python community is made up of members from around the globe with a diverse set of skills, personalities, and experiences. It is through these differences that our community experiences great successes and continued growth. When you're working with members of the community, we encourage you to follow these guidelines which help steer our interactions and strive to keep Python a positive, successful, and growing community.
sk: Python komunitu tvoria ľudia z celého sveta s rôznorodým súborom zručností, osobností a skúseností. Tieto rozdiely prispievajú k tomu, že naša komunita prežíva veľké úspechy a pokračuje v raste. Keď pracujete s členmi komunity, odporúčame vám dodržiavať tieto pokyny, ktoré pomáhajú riadiť váš styk s ostatnými a snažiť sa udržať Python komunitu pozitívnu, úspešnú a rastúcu.

source: A member of the Python community is:
sk: Člen Python komunity je:

source: Open
sk: Otvorený

source: Members of the community are open to collaboration, whether it's on PEPs, patches, problems, or otherwise. We're receptive to constructive comments and criticism, as the experiences and skill sets of other members contribute to the whole of our efforts. We're accepting of all who wish to take part in our activities, fostering an environment where anyone can participate and everyone can make a difference.
sk: Členovia komunity sú otvorení k spolupráci, či už ide priamo o vývoj samotného Pythonu, štandardnej knižnice, dokumentácie, PEPov, vývoj iných Python projektov, iných open source projektov, riešenie spoločensko prospešných problémov, alebo o prácu na iných spriatelených projektoch. Sme vnímaví ku komentárom a konštruktívnej kritike, pretože skúsenosti a zručnosti ostatných členov prispievajú k celému nášmu úsiliu. Prijímame všetkých, ktorí sa chcú zúčastniť našich aktivít, podporujeme prostredie, kde sa môže ktokoľvek podieľať a každý ho môže zlepšiť.

source: Considerate
sk: Ohľaduplný

source: Members of the community are considerate of their peers -- other Python users. We're thoughtful when addressing the efforts of others, keeping in mind that often times the labor was completed simply for the good of the community. We're attentive in our communications, whether in person or online, and we're tactful when approaching differing views.
sk: Členovia komunity sú ohľaduplní voči ostatným používateľom Pythonu. Rešpektujeme úsilie druhých, pričom máme na pamäti, že častokrát ich práca bola venovaná len pre dobro komunity. Sme všímaví v našich vyjadreniach, či už osobne alebo on-line a sme taktní, keď príde na rozdielne názory.

source: Respectful
sk: Úctivý

source: Members of the community are respectful. We're respectful of others, their positions, their skills, their commitments, and their efforts. We're respectful of the volunteer efforts that permeate the Python community. We're respectful of the processes set forth in the community, and we work within them. When we disagree, we are courteous in raising our issues.
sk: Členovia komunity sú úctiví. Rešpektujeme ostatných, ich pozíciu, ich zručnosti, ich záväzky a ich úsilie. Rešpektujeme dobrovoľné úsilie, ktoré venujú Python komunite. Rešpektujeme postupy stanovené v komunite a využívame ich pri práci. Keď nesúhlasíme, sme zdvorilí pri adresovaní našich problémov.

source: Overall, we're good to each other. We contribute to this community not because we have to, but because we want to. If we remember that, these guidelines will come naturally.
sk: Celkovo sme dobrí k sebe navzájom. Prispievame k tejto komunite nie preto, že musíme, ale preto, že chceme. Ak si to uvedomíme, tak nám tieto pokyny prídu prirodzené.

source: Slovak Python Community
sk: Slovenská Python komunita

source: PyCon SK and Python Meetup fully identify with the Code of Conduct of the Python community. We create an environment, which is open to everyone, independently of sex, sexual orientation, race, education or religion. All communication should be respectful and on professional level. We will be tolerant to each other.
sk: PyCon SK aj Python stretnutia sa plne stotožňujú s kódexom správania členov Python komunity. Prinášame prostredie, ktoré je otvorené pre všetkých, nezávisle na pohlaví, sexuálnej orientácii, postihnutí, fyzickom vzhľade, veľkosti, rase, vzdelaní či vierovyznaní. Každá komunikácia by mala byť úctivá a na profesionálnej úrovni. Buďme k sebe navzájom tolerantní.

source: We do not offend, vilify other members. We behave professionally. Harassment, sexist, racist or otherwise demeaning jokes are improper at our meetings. We will not tolerate any harassment of participants of meetups in any form.
sk: Neurážame, ani nezhadzujeme iných účastníkov. Správame sa profesionálne. Obťažovanie, sexistické, rasistické, alebo inak vyraďujúce vtipy sú nevhodné na našom stretnutí. Nebudeme tolerovať obťažovanie účastníkov stretnutia v akejkoľvek forme.

source: Where Teachers meet Programmers
sk: Stretnutie učiteľov s programátormi

source: EduSummit is a special section of the conference focused on teaching programming at primary and secondary schools. After two years of having an EduTrack at PyCon SK, consisting of a single day of talks for teachers, we are now organising a two day summit during which teachers will be introduced to innovative ways and methods of teaching programming, share their knowledge of useful tools and last but not least participate in numerous workshops given by experienced educators.
sk: EduSummit je špeciálna sekcia konferencie zameraná na vyučovanie programovania na základných a stredných školách. Po dvoch rokoch, keď sme v rámci PyCon SK organizovali EduTrack pozostávajúci z jedného dňa prednášok pre učiteľov, tentokrát pripravujeme rozšírený, dvojdňový program pre učiteľov a nadšencov vyučovania informatiky. Počas EduSummitu sa budeme venovať inovatívnym spôsobom a metódam vo vyučovaní informatiky, pričom si komunita učiteľov má možnosť zdieľať svoje skúsenosti a vedomosti o užitočných nástrojoch.

source: professor at ETH Zürich
sk: profesor na ETH Zürich

source: Professor Juraj Hromkovič is a university lecturer from Swiss Federal Institute of Technology (ETH) in Zürich.
sk: Profesor Juraj Hromkovič, DrSc., ktorý pôsobí ako vysokoškolský pedagóg vo Švajčiarskom federálnom technologickom inštitúte (ETH) v Zürichu.

source: He has authored many books and scientific publications dealing particularly with algorithmics, probabilistic algorithms and didactics of informatics. He focuses on education of informatics teachers and implementing of informatics to elementary schools. In 2017, he was awarded a 1st class Pribina Cross state order by President of Slovak republic Andrej Kiska.
sk: Je autorom mnohých kníh a vedeckých publikácií, najmä v oblasti algoritmiky, pravdepodobnostných algoritmov a didaktiky informatiky. Zameriava sa na vzdelávanie učiteľov informatiky a zavedenie vyučovania informatiky na základné školy. V roku 2017 prevzal štátne vyznamenanie Pribinov kríž I. triedy, ktoré mu udelil prezident SR Andrej Kiska.

source: CS student and Python enthusiast
sk: žiak informatiky a Python nadšenec

source: Luke is 17 and is studying computer science, maths, further maths and physics in Year 12 (English Secondary school / Sixthform). He loves to program in Python and thinks that the micro:bit is a great eductional tool and should be more widely used. He has given previous talks at Pycon UK and is looking forward to speaking at Pycon SK 2019.
sk: Luke je 17-ročný žiak informatiky, matematiky, pokročilej matematiky a fyziky v 12. ročníku z Rugby, UK. Rád programuje v Pythone a micro:bit považuje za skvelý nástroj na výuku, ktorý by sa mal oveľa viac využívať. V minulosti už prednášal na PyCon UK a teší sa na prednášku na PyCon SK 2019. Rozprávať bude v sekcii EduSummit o tom, ako spraviť informatiku pre žiakov na školách zaujímavejšou.

source: Why Attend?
sk: Prečo prísť?

source: Great speakers, workshops and hardware showcase
sk: Skvelí rečníci, workshopy a ukážky hardvéru

source: Speak at EduSummit
sk: Prednášaj na EduSummite

source: Call for Proposals is open. If you are a teacher or educator submit your talk or workshop and co-create the conference
sk: Výzva na prihlásenie príspevku je stále otvorená. Srdečne pozývame učiteľov a nadšencov vyučovania informatiky, aby si prihlásili prednášku, workshop alebo poster a tým sa stali spolutvorcami obsahu konferencie. Viac info

source: here
sk: tu

source: On saturday, we will host a Young Coders' day, consisting of programming workshops for children.
sk: V sobotu sa bude konať Young Coders' day, pozostávajúci z programovacích dielní pre deti.
